
#불 (Bool) 자료형
# 참(True)과 거짓(False)를 나타내는 자료형 -> 항상 대문자
print("\n" + "-" * 10, "불 자료형, type 확인", "-" * 10)

# 등호의 결괏값 (1 == 1)

# 부등호의 결괏값 (2 > 1, 2 < 1)


#자료형의 참과 거짓
print("\n" + "-" * 10, "자료형의 참과 거짓", "-" * 10)
#문자열 : 참 / 빈 문자열 : 거짓

#리스트 : 참 / 빈 리스트 : 거짓

#튜플 : 참 / 빈 튜플 : 거짓

# 1 : 참 / 0 : 거짓 / None : 거짓


#if문을 이용한 True/False 예시
print("\n" + "-" * 10, "if문을 이용한 True/False 예시", "-" * 10)
"""
if [] : 
    print("참")
else : 
    print("거짓")
"""

"""
if 1 :
    print("참")
else : 
    print("거짓")
"""



#불 연산 (bool(x))
print("\n" + "-" * 10, "불 연산", "-" * 10)



'''copy 모듈 (a = copy(b) / a = b[:])
   모듈(module) : 함수나 변수 또는 클래스를 모아놓은 파일
                다른 파이썬 프로그램에서 불러와 사용할 수 있게 만든 파이썬 파일이라고 할 수 있다. 
'''
print("\n" + "-" * 10, "copy 모듈", "-" * 10)
# a is b 로 확인 -> boolean 값 반환
